Tekla.Structures.ModelInternal.CDelegate
CDelegate includes all the platform invoke commands user process can call.
It uses CDelegateSynchronized to deliver the calls to C-interface.
Adding a new class to interface goes like this:
1. Add a new delegate function type to definitions in this class.
2. Add Create/Select/Modify functions according to examples to this class.
3. Add Matching EndInvoke function to CDelegateSynchronized class.
4. Add Create/Select/Modify functions according to examples to CDelegateSynchronized
5. Add public static extern int functions for Create/Select/Modify to the end of CDelegateSynchronized.
6. Implement the static functions to TS.
7. Test

Tekla.Structures.ModelInternal.CDelegate.#ctor
Instantiates a new CDelegate